In [25]:
import numpy as np 
import pandas as pd 
import seaborn as sns 
import matplotlib.pyplot as plt 
import os

In [26]:
df = pd.read_csv('./AllSTPrecipitation.csv')
df.head()

              Time  Pokhara Airport  Lumle  Begnas  Lamachour
0  01/01/2015 3:00              0.0    0.0     0.0        0.0
1  01/02/2015 3:00             15.4   29.0    16.8       19.6
2  01/03/2015 3:00             21.4   26.4    33.6       20.8
3  01/04/2015 3:00             15.9   15.9    11.6       10.0
4  01/05/2015 3:00              0.0    0.0     0.0        0.0

In [27]:
df

                     Time  Pokhara Airport  Lumle  Begnas  Lamachour
0         01/01/2015 3:00              0.0    0.0     0.0        0.0
1         01/02/2015 3:00             15.4   29.0    16.8       19.6
2         01/03/2015 3:00             21.4   26.4    33.6       20.8
3         01/04/2015 3:00             15.9   15.9    11.6       10.0
4         01/05/2015 3:00              0.0    0.0     0.0        0.0
...                   ...              ...    ...     ...        ...
2764  07/27/2022 03:00:00             51.1    7.0    98.0       20.0
2765  07/28/2022 03:00:00             15.7   60.9    13.0      132.0
2766  07/29/2022 03:00:00              3.5   11.1     7.0        2.0
2767  07/30/2022 03:00:00             27.3   31.2    12.0       34.2
2768  07/31/2022 03:00:00             33.4   36.2    63.0       84.0

[2769 rows x 5 columns]

In [28]:
# checking the missing date
# Setting the Date values as index
# df = df.set_index('Time')
 
# # to_datetime() method converts string
# # format to a DateTime object
# df.index = pd.to_datetime(df.index)
 
# # dates which are not in the sequence
# # are returned
# print(pd.date_range(
#   start="2015-01-01 03:00:00", end="2022-07-31 03:00:00").difference(df.index))

In [32]:
#change the format of the date:
df['Time']=pd.to_datetime(df['Time'])
#changing the format of the date
df['Time']= df["Time"].dt.strftime('%Y-%m-%d 03:00:00')
df[:10]

                  Time  Pokhara Airport  Lumle  Begnas  Lamachour
0  2015-01-01 03:00:00              0.0    0.0     0.0        0.0
1  2015-01-02 03:00:00             15.4   29.0    16.8       19.6
2  2015-01-03 03:00:00             21.4   26.4    33.6       20.8
3  2015-01-04 03:00:00             15.9   15.9    11.6       10.0
4  2015-01-05 03:00:00              0.0    0.0     0.0        0.0
5  2015-01-06 03:00:00              0.0    0.0     0.0        0.0
6  2015-01-07 03:00:00              0.0    0.0     0.0        0.0
7  2015-01-08 03:00:00              1.6   24.4     0.0        6.0
8  2015-01-09 03:00:00              0.0    0.0     0.0        0.0
9  2015-01-10 03:00:00              0.0    0.0     0.0        0.0